{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Определение вида треугольника\n",
    "\n",
    "**Цель:**  \n",
    "Написать программу на Python, которая будет проверять, могут ли три заданных числа быть сторонами треугольника, и если могут, определит вид этого треугольника по его сторонам и углам.\n",
    "\n",
    "### Условие задачи:\n",
    "1. Напишите программу, которая принимает на вход три числа \\(a\\), \\(b\\) и \\(c\\), представляющие длины сторон треугольника.\n",
    "2. Программа должна сначала проверить, могут ли эти числа образовать треугольник. Для этого используйте условие:\n",
    "   - Сумма любых двух сторон должна быть больше третьей.\n",
    "   \n",
    "   Если хотя бы одно из этих условий не выполняется, программа должна вывести: **\"Это не треугольник\"**.\n",
    "\n",
    "3. Если треугольник существует, программа должна определить его тип:\n",
    "   - **Равносторонний треугольник**, если все стороны равны.\n",
    "   - **Равнобедренный треугольник**, если две стороны равны.\n",
    "   - **Разносторонний треугольник**, если все стороны разные.\n",
    "\n",
    "4. Программа также должна определить вид треугольника по углам:\n",
    "   - **Прямоугольный треугольник**, если выполняется теорема Пифагора для одной из сторон.\n",
    "   - **Остроугольный треугольник**, если все углы острые.\n",
    "   - **Тупоугольный треугольник**, если один угол тупой.\n",
    "\n",
    "### Подсказки:\n",
    "1. Для проверки треугольника по углам используйте теорему Пифагора:\n",
    "   - Прямоугольный треугольник: \\(a^2 + b^2 = c^2\\)\n",
    "2. Для проверки тупоугольного треугольника убедитесь, что сумма квадратов двух меньших сторон меньше квадрата третьей стороны.\n",
    "\n",
    "### Задание:\n",
    "1. Напишите программу, используя предложенные шаги.\n",
    "2. Протестируйте её с разными значениями сторон, чтобы проверить, как программа определяет разные виды треугольников."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Это треугольник\n",
      "Равносторонний\n",
      "Остроугольный\n"
     ]
    }
   ],
   "source": [
    "a, b, c = 10, 10, 10\n",
    "\n",
    "if a + b > c and a + c > b and b + c > a:\n",
    "    print(\"Это треугольник\")\n",
    "    print(\"Равносторонний\" if a == b == c else \"Равнобедренный\" if a == b or a == c or b == c else \"Разносторонний\")\n",
    "    print(\"Прямоугольный\" if a**2 + b**2 == c**2 or a**2 + c**2 == b**2 or b**2 + c**2 == a**2 else \n",
    "          \"Остроугольный\" if a**2 + b**2 > c**2 and a**2 + c**2 > b**2 and b**2 + c**2 > a**2 else \"Тупоугольный\")\n",
    "else:\n",
    "    print(\"Это не треугольник\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача \n",
    "\n",
    "Напишите программу, которая использует списковое включение для создания нового списка, содержащего длины каждого слова из следующего списка:\n",
    "\n",
    "```python\n",
    "words = [\"hello\", \"world\", \"python\", \"programming\", \"is\", \"fun\"]\n",
    "```\n",
    "\n",
    "**Инструкции:**\n",
    "\n",
    "1. Используйте списковое включение, чтобы пройти по каждому слову в списке `words`.\n",
    "2. Для каждого слова определите его длину с помощью функции `len()`.\n",
    "3. Создайте новый список, который будет содержать длины всех слов из исходного списка.\n",
    "4. Выведите новый список на экран.\n",
    "\n",
    "**Ожидаемый результат:** \n",
    "\n",
    "Программа должна вывести следующий список:\n",
    "\n",
    "```\n",
    "[5, 5, 6, 11, 2, 3]\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[5, 5, 6, 11, 2, 3]\n"
     ]
    }
   ],
   "source": [
    "print([len(word) for word in [\"hello\", \"world\", \"python\", \"programming\", \"is\", \"fun\"]])\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача: Поиск минимального числа в списке\n",
    "\n",
    "**Описание:** \n",
    "\n",
    "Напишите функцию, которая принимает список чисел и возвращает минимальное число из этого списка. Функция должна работать для списков любого размера и содержать как положительные, так и отрицательные числа.\n",
    "\n",
    "**Требования:**\n",
    "\n",
    "1. Функция должна называться `find_minimum`.\n",
    "2. Она должна принимать один аргумент — список чисел (например, `[3, 5, -1, 7, 0]`).\n",
    "3. Функция должна возвращать минимальное число из переданного списка.\n",
    "4. Если список пустой, функция должна возвращать `None` или выводить сообщение об ошибке.\n",
    "\n",
    "\n",
    "### Подсказка:\n",
    "\n",
    "Вы можете использовать цикл для перебора элементов списка или встроенную функцию `min()` для нахождения минимального значения. Также не забудьте обработать случай, когда список пуст. \n",
    "\n",
    "### Ожидаемый результат:\n",
    "\n",
    "При вызове функции с непустым списком чисел функция должна вернуть минимальное число, а при вызове с пустым списком — `None` или соответствующее сообщение."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_minimum(numbers):\n",
    "    return min(numbers) if numbers else None\n",
    "\n",
    "print(find_minimum([3, 5, -1, 7, 0])) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача: Повторение строки\n",
    "\n",
    "**Описание:**\n",
    "\n",
    "Напишите функцию, которая принимает строку и целое число, указывающее, сколько раз строка должна быть повторена. Функция должна возвращать новую строку, состоящую из повторяющейся строки, разделённой пробелами.\n",
    "\n",
    "**Требования:**\n",
    "\n",
    "1. Функция должна называться `repeat_string`.\n",
    "2. Она должна принимать два аргумента:\n",
    "   - `text` (строка), которую нужно повторить.\n",
    "   - `count` (целое число), указывающее количество повторений.\n",
    "3. Функция должна возвращать строку, содержащую `count` повторений `text`, разделённых пробелами.\n",
    "4. Если `count` равен нулю или меньше, функция должна возвращать пустую строку.\n",
    "\n",
    "\n",
    "### Ожидаемый результат:\n",
    "\n",
    "При вызове функции с указанной строкой и количеством повторений функция должна вернуть строку, состоящую из повторяющихся значений, разделённых пробелами. Если количество повторений равно нулю, функция должна вернуть пустую строку."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "hello hello hello\n"
     ]
    }
   ],
   "source": [
    "def repeat_string(text, count):\n",
    "    return \" \".join([text] * count) if count > 0 else \"\"\n",
    "\n",
    "print(repeat_string(\"hello\", 3)) "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
